//
//  FishData.swift
//  sample
//
//  Created by cmStudent on 2022/09/05.
//

import SwiftUI

class FishData : ObservableObject {
    
    //必要そうなもの
    //線の太さ INT + frame　同じ値
    //魚が掛かってから引き上げるまでの時間（この時間内に引き上げないと釣れない）
    //魚の画像名 String
    //魚の名前 String
    //魚の大きさ INT
    // コメント
    
    static var shared = FishData()
    
    @Published var startfishdata : Double = 1.0
    @Published var randomfish : Int = 0
    //@Published var randomfishs : String = ""
    
    

    let fish:[[String]] = [["100","1", "メガロドン", "メガドロン", "20m", "史上最大のサメを釣り上げた！！！"],
                           ["3","3", "クマノミ", "クマノミ", "7cm", "可愛いクマノミを釣り上げた！"],
                           ["25","1", "ジンベイザメ２", "ジンベイザメ", "10m", "最大のジンベイザメを釣り上げた！！！"],
                           ["20","1", "ジンベイザメ１", "ジンベイザメ", "6m", "ジンベイザメを釣り上げた！！"],
                           ["5","2", "イシダイ３", "イシダイ", "28cm", "イシダイを釣り上げた！"],
                           ["4","2", "イシダイ２", "イシダイ", "14cm", "イシダイを釣り上げた！"],
                           ["3","2", "イシダイ１", "イシダイ", "7cm", "イシダイを釣り上げた！"],
                           ["18","1", "サメ３", "サメ", "5m", "サメを釣り上げた！！"],
                           ["14","1", "サメ２", "サメ", "4m", "サメを釣り上げた！！"],
                           ["10","1", "サメ１", "サメ", "3m", "サメを釣り上げた！！"], // 10
                           ["3","3", "アンチョビ", "アンチョビ", "5cm", "アンチョビを釣り上げた！"],
                           ["5","3", "スズキ３", "スズキ", "25cm", "スズキを釣り上げた！"],
                           ["4","3", "スズキ２", "スズキ", "12cm", "スズキを釣り上げた！"],
                           ["3","3", "スズキ１", "スズキ", "8cm", "スズキを釣り上げた！"],
                           ["8","2", "シーラカンス", "シーラカンス", "36cm", "シーラカンスを釣り上げた！！"],
                           ["4","3", "チョウチョウウオ２", "チョウチョウウオ", "10cm", "チョウチョウウオを釣り上げた！"],
                           ["3","3", "チョウチョウウオ１", "チョウチョウウオ", "6cm", "チョウチョウウオを釣り上げた！"],
                           ["4","3", "ナンヨウハギ２", "ナンヨウハギ", "6cm", "ナンヨウハギを釣り上げた！"],
                           ["3","3", "ナンヨウハギ１", "ナンヨウハギ", "4cm", "ナンヨウハギを釣り上げた！"],
                           ["3","3", "空き缶", "空き缶", "10cm", "空き缶をを釣り上げた！"], // 20
                           ["4","3", "イカ", "イカ", "7cm", "イカをを釣り上げた！"],
                           ["5","3", "ワカメ１", "ワカメ", "2m", "ワカメをを釣り上げた！"],
                           ["6","3", "ワカメ２", "ワカメ", "3m", "ワカメをを釣り上げた！"],
                           ["10","2", "シュモクザメ２", "シュモクザメ", "3m", "シュモクザメをを釣り上げた！"],
                           ["7","2", "シュモクザメ１", "シュモクザメ", "1.5m", "シュモクザメをを釣り上げた！"],
                           ["6","2", "マグロ２", "マグロ", "1m", "マグロをを釣り上げた！"],
                           ["4","2", "マグロ１", "マグロ", "70cm", "マグロをを釣り上げた！"],
                           ["3","3", "イワシ１", "イワシ", "6cm", "イワシをを釣り上げた！"],
                           ["3","3", "イワシ２", "イワシ", "8cm", "イワシをを釣り上げた！"],
                           ["3","3", "シシャモ１", "シシャモ", "6cm", "シシャモをを釣り上げた！"], // 30
                           ["3","3", "シシャモ２", "シシャモ", "8cm", "シシャモをを釣り上げた！"],]
    
//    let dfish:[[Double]] = [[50,1],
//                            [3,3],
//                            [25,1],
//                            [20,1],
//                            [5,2],
//                            [4,2],
//                            [3,2],
//                            [18,1],
//                            [14,1],
//                            [10,1],
//                            [3,3],
//                            [5,3],
//                            [4,3],
//                            [3,3],
//                            [8,2],
//                            [4,3],
//                            [3,3],
//                            [4,3],
//                            [3,3],
//                            [3,3],
//                            [4,3],
//                            [6,3],
//                            [10,2],
//                            [7,2],
//                            [6,2],
//                            [4,2],]
    
    func startfish() {
        randomfish = Int.random(in: 0...30)
        startfishdata = Double(fish[randomfish][0]) ?? 0.0
        //startfishdata = dfish[randomfish][0]
    }
}
